{
    "Aadhya": {
        "meaning": "First power, first goddess",
        "detailed_meaning": "Aadhya represents the primordial power and is another name for Goddess Durga. It signifies being the first or the beginning of everything.",
        "gender": "Female",
        "origin": "Sanskrit",
        "religious_significance": "In Hindu mythology, Aadhya Shakti refers to the primordial cosmic energy and is associated with Goddess Durga, the divine mother who represents power and protection.",
        "rashi": "Mesh (Aries)",
        "numerology": {
            "number": "1",
            "meaning": "People with this name are natural-born leaders, independent, and ambitious. They have strong willpower and are often pioneers in their chosen field."
        },
        "variations": ["Aadya", "Adya", "Aadiya"],
        "lucky_elements": {
            "color": "Red, Yellow",
            "day": "Sunday",
            "number": "1, 4"
        },
        "popularity": "Rising"
    },
    "Aadi": {
        "meaning": "Beginning, first",
        "detailed_meaning": "Aadi represents the beginning or the source of everything. It symbolizes originality and leadership qualities.",
        "gender": "Male",
        "origin": "Sanskrit",
        "religious_significance": "In Hindu tradition, 'Aadi' is often associated with Lord Vishnu, who is considered the beginning of all creation. The term is also used in 'Aadi Ananta' meaning 'from the beginning to the infinite'.",
        "rashi": "Mesh (Aries)",
        "numerology": {
            "number": "1",
            "meaning": "Those named Aadi tend to be natural leaders with strong determination and independence. They often pioneer new paths and inspire others."
        },
        "variations": ["Adi", "Aadith", "Aditya"],
        "lucky_elements": {
            "color": "Red, Gold",
            "day": "Sunday",
            "number": "1, 9"
        }
    },
    "Aarav": {
        "meaning": "Peaceful, wisdom",
        "detailed_meaning": "Aarav signifies someone who brings peace and tranquility. The name represents a person who is wise, calm, and maintains harmony in their surroundings.",
        "gender": "Male",
        "origin": "Sanskrit",
        "religious_significance": "The name has connections to ancient Hindu texts where peace and wisdom are considered divine qualities. It's believed that people with this name have a natural ability to resolve conflicts.",
        "rashi": "Karka (Cancer)",
        "numerology": {
            "number": "6",
            "meaning": "Those named Aarav are often peaceful mediators with strong emotional intelligence. They value harmony and have a natural ability to understand others."
        },
        "variations": ["Arav", "Araav", "Araavh"],
        "lucky_elements": {
            "color": "White, Silver",
            "day": "Monday",
            "number": "2, 6"
        },
        "popularity": "Very Popular"
    },
    "Aditi": {
        "meaning": "Boundless, entire, free",
        "detailed_meaning": "Aditi represents limitless power and freedom. The name symbolizes someone who is unbound by constraints and has infinite potential.",
        "gender": "Female",
        "origin": "Sanskrit",
        "religious_significance": "In Hindu mythology, Aditi is the mother of the gods (Devas) and is considered the personification of infinite space and consciousness. She is also known as the mother of light and the source of all existence.",
        "rashi": "Vrischika (Scorpio)",
        "numerology": {
            "number": "7",
            "meaning": "People named Aditi are often spiritual, mysterious, and seekers of knowledge. They have a deep connection with universal wisdom and are naturally intuitive."
        },
        "variations": ["Adithi", "Adhiti", "Aaditi"],
        "lucky_elements": {
            "color": "Blue, Purple",
            "day": "Thursday",
            "number": "7, 3"
        }
    },
    "Amit": {
        "meaning": "Infinite, boundless",
        "detailed_meaning": "Amit represents limitless potential and infinite possibilities. The name suggests someone who has immeasurable qualities and capabilities.",
        "gender": "Male",
        "origin": "Sanskrit",
        "religious_significance": "The concept of 'Amit' is found in various Hindu scriptures, often used to describe the infinite nature of the divine. It's particularly associated with 'Amitabha' (infinite light) in Buddhist traditions as well.",
        "rashi": "Mithuna (Gemini)",
        "numerology": {
            "number": "9",
            "meaning": "Those named Amit often have humanitarian qualities and are blessed with universal understanding. They tend to be compassionate and work for the greater good."
        },
        "variations": ["Amith", "Ameet", "Amitabh"],
        "lucky_elements": {
            "color": "Yellow, Orange",
            "day": "Thursday",
            "number": "3, 9"
        }
    },
    "Ananya": {
        "meaning": "Unique, without equal",
        "detailed_meaning": "Ananya means 'without equal' or 'one of a kind'. It represents someone who is unique and incomparable in their qualities and achievements.",
        "gender": "Female",
        "origin": "Sanskrit",
        "religious_significance": "In Hindu philosophy, 'Ananya Bhakti' means undivided devotion. The name represents pure dedication and uniqueness in spiritual context.",
        "rashi": "Simha (Leo)",
        "numerology": {
            "number": "4",
            "meaning": "People named Ananya are often methodical, organized, and have strong foundations. They are reliable and work systematically towards their goals."
        },
        "variations": ["Anaya", "Anaanya", "Ananyaa"],
        "lucky_elements": {
            "color": "Gold, Orange",
            "day": "Sunday",
            "number": "1, 4"
        },
        "popularity": "Trending"
    }
}
